http/results/retro2-effects-libev-R20000-r5.txt
Running 20s test @ http://127.0.0.1:19306/
  4 threads and 100 connections
  Thread calibration: mean lat.: 2.877ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.892ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.907ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.943ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.76ms  728.05us   6.37ms   69.10%
    Req/Sec     5.27k   798.87     8.33k    74.43%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.71ms
 75.000%    2.21ms
 90.000%    2.69ms
 99.000%    3.75ms
 99.900%    4.97ms
 99.990%    5.86ms
 99.999%    6.35ms
100.000%    6.38ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.121     0.000000            1         1.00
       0.855     0.100000        19763         1.11
       1.125     0.200000        39569         1.25
       1.338     0.300000        59292         1.43
       1.530     0.400000        79002         1.67
       1.711     0.500000        98769         2.00
       1.800     0.550000       108706         2.22
       1.894     0.600000       118611         2.50
       1.991     0.650000       128419         2.86
       2.095     0.700000       138376         3.33
       2.207     0.750000       148259         4.00
       2.267     0.775000       153127         4.44
       2.333     0.800000       158093         5.00
       2.403     0.825000       162941         5.71
       2.483     0.850000       167931         6.67
       2.575     0.875000       172876         8.00
       2.629     0.887500       175334         8.89
       2.689     0.900000       177819        10.00
       2.757     0.912500       180252        11.43
       2.829     0.925000       182703        13.33
       2.917     0.937500       185175        16.00
       2.967     0.943750       186391        17.78
       3.025     0.950000       187626        20.00
       3.085     0.956250       188880        22.86
       3.155     0.962500       190102        26.67
       3.237     0.968750       191340        32.00
       3.283     0.971875       191950        35.56
       3.337     0.975000       192576        40.00
       3.401     0.978125       193190        45.71
       3.465     0.981250       193804        53.33
       3.547     0.984375       194427        64.00
       3.591     0.985938       194722        71.11
       3.649     0.987500       195034        80.00
       3.711     0.989062       195341        91.43
       3.781     0.990625       195649       106.67
       3.873     0.992188       195964       128.00
       3.923     0.992969       196113       142.22
       3.977     0.993750       196271       160.00
       4.031     0.994531       196419       182.86
       4.123     0.995313       196578       213.33
       4.247     0.996094       196732       256.00
       4.303     0.996484       196807       284.44
       4.351     0.996875       196883       320.00
       4.427     0.997266       196961       365.71
       4.519     0.997656       197038       426.67
       4.635     0.998047       197116       512.00
       4.687     0.998242       197152       568.89
       4.767     0.998437       197192       640.00
       4.827     0.998633       197229       731.43
       4.903     0.998828       197268       853.33
       4.983     0.999023       197309      1024.00
       5.019     0.999121       197326      1137.78
       5.067     0.999219       197345      1280.00
       5.119     0.999316       197365      1462.86
       5.179     0.999414       197384      1706.67
       5.223     0.999512       197403      2048.00
       5.283     0.999561       197413      2275.56
       5.323     0.999609       197422      2560.00
       5.379     0.999658       197433      2925.71
       5.443     0.999707       197443      3413.33
       5.515     0.999756       197452      4096.00
       5.547     0.999780       197457      4551.11
       5.643     0.999805       197461      5120.00
       5.687     0.999829       197466      5851.43
       5.739     0.999854       197472      6826.67
       5.795     0.999878       197475      8192.00
       5.855     0.999890       197478      9102.22
       5.863     0.999902       197480     10240.00
       5.887     0.999915       197483     11702.86
       5.987     0.999927       197485     13653.33
       6.027     0.999939       197487     16384.00
       6.035     0.999945       197489     18204.44
       6.063     0.999951       197490     20480.00
       6.071     0.999957       197491     23405.71
       6.083     0.999963       197492     27306.67
       6.087     0.999969       197493     32768.00
       6.103     0.999973       197494     36408.89
       6.163     0.999976       197495     40960.00
       6.163     0.999979       197495     46811.43
       6.247     0.999982       197496     54613.33
       6.247     0.999985       197496     65536.00
       6.347     0.999986       197497     72817.78
       6.347     0.999988       197497     81920.00
       6.347     0.999989       197497     93622.86
       6.367     0.999991       197498    109226.67
       6.367     0.999992       197498    131072.00
       6.367     0.999993       197498    145635.56
       6.367     0.999994       197498    163840.00
       6.367     0.999995       197498    187245.71
       6.375     0.999995       197499    218453.33
       6.375     1.000000       197499          inf
#[Mean    =        1.758, StdDeviation   =        0.728]
#[Max     =        6.372, Total count    =       197499]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  398818 requests in 20.00s, 805.57MB read
Requests/sec:  19940.13
Transfer/sec:     40.28MB

JSON Output:
{
	"requests": 398818,
	"duration_in_microseconds": 20000770.00,
	"bytes": 844696524,
	"requests_per_sec": 19940.13,
	"bytes_transfer_per_sec": 42233200.22,
	"latency_distribution": [
		{
			"percentile": 50,
			"latency_in_microseconds": 1711
		},
		{
			"percentile": 75,
			"latency_in_microseconds": 2207
		},
		{
			"percentile": 90,
			"latency_in_microseconds": 2689
		},
		{
			"percentile": 99,
			"latency_in_microseconds": 3751
		},
		{
			"percentile": 99.9,
			"latency_in_microseconds": 4975
		},
		{
			"percentile": 99.99,
			"latency_in_microseconds": 5859
		},
		{
			"percentile": 99.999,
			"latency_in_microseconds": 6347
		},
		{
			"percentile": 100,
			"latency_in_microseconds": 6375
		}
	]
}