http/results/retro2-effects-libev-R5000-r1.txt
Running 20s test @ http://127.0.0.1:19218/
  4 threads and 100 connections
  Thread calibration: mean lat.: 1.774ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.716ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.858ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.672ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.92ms    1.08ms   7.74ms   74.86%
    Req/Sec     1.32k   642.66     2.78k    75.34%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.71ms
 75.000%    2.39ms
 90.000%    3.32ms
 99.000%    5.58ms
 99.900%    6.85ms
 99.990%    7.38ms
 99.999%    7.75ms
100.000%    7.75ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.144     0.000000            1         1.00
       0.789     0.100000         4947         1.11
       1.053     0.200000         9875         1.25
       1.286     0.300000        14832         1.43
       1.496     0.400000        19751         1.67
       1.707     0.500000        24693         2.00
       1.815     0.550000        27145         2.22
       1.938     0.600000        29624         2.50
       2.071     0.650000        32081         2.86
       2.217     0.700000        34553         3.33
       2.387     0.750000        37040         4.00
       2.489     0.775000        38251         4.44
       2.603     0.800000        39492         5.00
       2.729     0.825000        40738         5.71
       2.877     0.850000        41954         6.67
       3.065     0.875000        43189         8.00
       3.177     0.887500        43804         8.89
       3.315     0.900000        44423        10.00
       3.471     0.912500        45038        11.43
       3.679     0.925000        45655        13.33
       3.923     0.937500        46271        16.00
       4.045     0.943750        46578        17.78
       4.195     0.950000        46891        20.00
       4.347     0.956250        47200        22.86
       4.507     0.962500        47505        26.67
       4.667     0.968750        47812        32.00
       4.755     0.971875        47968        35.56
       4.855     0.975000        48126        40.00
       4.971     0.978125        48277        45.71
       5.095     0.981250        48431        53.33
       5.239     0.984375        48586        64.00
       5.311     0.985938        48663        71.11
       5.403     0.987500        48741        80.00
       5.511     0.989062        48817        91.43
       5.631     0.990625        48892       106.67
       5.739     0.992188        48969       128.00
       5.827     0.992969        49009       142.22
       5.907     0.993750        49049       160.00
       5.995     0.994531        49085       182.86
       6.079     0.995313        49123       213.33
       6.159     0.996094        49163       256.00
       6.215     0.996484        49181       284.44
       6.255     0.996875        49200       320.00
       6.323     0.997266        49221       365.71
       6.423     0.997656        49239       426.67
       6.519     0.998047        49258       512.00
       6.583     0.998242        49269       568.89
       6.647     0.998437        49277       640.00
       6.691     0.998633        49288       731.43
       6.763     0.998828        49297       853.33
       6.863     0.999023        49306      1024.00
       6.895     0.999121        49311      1137.78
       6.943     0.999219        49316      1280.00
       6.967     0.999316        49322      1462.86
       7.003     0.999414        49326      1706.67
       7.043     0.999512        49330      2048.00
       7.083     0.999561        49333      2275.56
       7.135     0.999609        49335      2560.00
       7.155     0.999658        49338      2925.71
       7.167     0.999707        49340      3413.33
       7.263     0.999756        49342      4096.00
       7.291     0.999780        49345      4551.11
       7.291     0.999805        49345      5120.00
       7.299     0.999829        49347      5851.43
       7.299     0.999854        49347      6826.67
       7.351     0.999878        49348      8192.00
       7.383     0.999890        49349      9102.22
       7.515     0.999902        49350     10240.00
       7.515     0.999915        49350     11702.86
       7.543     0.999927        49351     13653.33
       7.543     0.999939        49351     16384.00
       7.583     0.999945        49352     18204.44
       7.583     0.999951        49352     20480.00
       7.583     0.999957        49352     23405.71
       7.599     0.999963        49353     27306.67
       7.599     0.999969        49353     32768.00
       7.599     0.999973        49353     36408.89
       7.599     0.999976        49353     40960.00
       7.599     0.999979        49353     46811.43
       7.747     0.999982        49354     54613.33
       7.747     1.000000        49354          inf
#[Mean    =        1.925, StdDeviation   =        1.081]
#[Max     =        7.744, Total count    =        49354]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  98564 requests in 20.00s, 199.09MB read
Requests/sec:   4927.59
Transfer/sec:      9.95MB

JSON Output:
{
	"requests": 98564,
	"duration_in_microseconds": 20002490.00,
	"bytes": 208758552,
	"requests_per_sec": 4927.59,
	"bytes_transfer_per_sec": 10436628.24,
	"latency_distribution": [
		{
			"percentile": 50,
			"latency_in_microseconds": 1707
		},
		{
			"percentile": 75,
			"latency_in_microseconds": 2387
		},
		{
			"percentile": 90,
			"latency_in_microseconds": 3315
		},
		{
			"percentile": 99,
			"latency_in_microseconds": 5583
		},
		{
			"percentile": 99.9,
			"latency_in_microseconds": 6851
		},
		{
			"percentile": 99.99,
			"latency_in_microseconds": 7383
		},
		{
			"percentile": 99.999,
			"latency_in_microseconds": 7747
		},
		{
			"percentile": 100,
			"latency_in_microseconds": 7747
		}
	]
}